app/controllers/users_controller.rb

INSERT INTO "users" ("username", "mail", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "asd<asd"], ["mail", ""], ["password", "szdf"], ["created_at", "2019-10-06 23:05:02.981624"], ["updated_at", "2019-10-06 23:05:02.981624"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "pedromoreno"], ["updated_at", "2019-10-08 17:21:25.037305"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)